package com.hxjt.dqyt.app;

import com.hxjt.dqyt.R;
import com.hxjt.dqyt.bean.MenuButtonBean;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

/**
 * @author by DELL
 * @date on 2018/2/6
 * @describe
 */

public class Constants {
    public static final String IP_ADDRESS = "ip_address"; //ip地址
    public static final String PORT = "port"; //端口号

    public static final String PASSWORD_FHZ = "password_fhz"; //分合闸密码

    public static final String DEFAULT_IP_ADDRESS = "192.168.1.100"; //TCP默认IP
    public static final String DEFAULT_PORT = "6789"; //TCP默认端口号
    public static final String CONFIG_MENU_CODES = "config_menu_codes"; //已配置的菜单
    public static final String DLQ_TYPE = "dlq_type";
    public static final String STATIC_IP = "static_ip";
    public static final String WANG_GUAN_CODE = "wang_guan_code";

    public static final String RECEIVED_MESSAGE = "received_message";
    public static final String CONNECTION_CHANGED = "connection_changed";
    public static final String IF_HAS_JDQ = "if has jdq device";

    public static final String BPQ ="bpq" ; //变频器
    public static final String DLQ ="dlq" ; //断路器
    public static final String WSD_CGQ ="wsdcgq" ; //温湿度传感器
    public static final String ZS_CGQ ="zscgq" ; //噪声传感器
    public static final String YW_CGQ ="ywcgq" ; //烟雾传感器
    public static final String CLZS_CGQ ="clzscgq" ; //齿轮转速传感器
    public static final String ZDJC_CGQ ="zdjccgq" ; //震动监测传感器
    public static final String SJ_BSQ ="sjcgq" ; //水浸变送器
    public static final String YM_CSY ="ymcsy" ; //液面测试仪
    public static final String SK645 ="sk645" ; //塑壳
    public static final String JCQ ="jcq" ; //接触器

    public static final String[] ALL_MENU_CODES = new String[]{
            "bpq",
            "wsdcgq",
            "zscgq",
            "ywcgq",
            "clzscgq",
            "zdjccgq",
            "sjcgq",
            "ymcsy",
            "sk645",
    };

    public static final String[] DEFAULT_MENU_CODES = new String[]{
            "bpq",
            "wsdcgq",
            "zscgq",
            "ywcgq",
            "clzscgq",
            "zdjccgq",
            "sjcgq",
            "ymcsy",
    };

    public  List<MenuButtonBean> MENU_BUTTON_BEAN_LIST = new ArrayList<MenuButtonBean>() {{
        add(createMenu("变频器", R.drawable.icon_bpq_blue,"bpq"));
//        add(createMenu("断路器", R.drawable.icon_dlq_blue,"dlq"));
        add(createMenu("温湿度\n传感器", R.drawable.icon_cgq_blue,"wsdcgq"));
        add(createMenu("噪声\n传感器", R.drawable.icon_cgq_blue,"zscgq"));
        add(createMenu("烟雾\n传感器", R.drawable.icon_cgq_blue,"ywcgq"));
        add(createMenu("齿轮转速\n传感器", R.drawable.icon_cgq_blue,"clzscgq"));
        add(createMenu("震动监测\n传感器", R.drawable.icon_cgq_blue,"zdjccgq"));
        add(createMenu("水浸\n变送器", R.drawable.icon_bsq_blue,"sjcgq"));
        add(createMenu("液面\n测试仪", R.drawable.icon_bsq_blue,"ymcsy"));
    }};

    // 创建菜单项的方法
    private static MenuButtonBean createMenu(String text, int resourceId,String typeCode) {
        HashMap<String, Object> menu = new HashMap<>();
        menu.put("name", text);
        menu.put("resourceId", resourceId);
        menu.put("typeCode", typeCode); // 默认选中

        return MenuButtonBean.fromMap(menu);
    }

    public static double[] MockS = {
            0, 0, 0, 0.01, 0.02, 0.02, 0.04, 0.05, 0.06, 0.08, 0.1, 0.12, 0.14, 0.16,
            0.18, 0.21, 0.23, 0.26, 0.29, 0.32, 0.36, 0.39, 0.43, 0.46, 0.5, 0.54,
            0.58, 0.62, 0.66, 0.7, 0.75, 0.79, 0.83, 0.88, 0.93, 0.97, 1.02, 1.07,
            1.12, 1.17, 1.22, 1.27, 1.32, 1.37, 1.42, 1.47, 1.52, 1.57, 1.62, 1.68,
            1.73, 1.78, 1.83, 1.88, 1.94, 1.99, 2.04, 2.09, 2.14, 2.19, 2.25, 2.3,
            2.35, 2.4, 2.44, 2.49, 2.54, 2.59, 2.63, 2.68, 2.72, 2.77, 2.81, 2.85,
            2.89, 2.93, 2.97, 3.01, 3.05, 3.09, 3.12, 3.15, 3.19, 3.22, 3.25, 3.27,
            3.3, 3.33, 3.35, 3.37, 3.39, 3.41, 3.42, 3.44, 3.45, 3.46, 3.47, 3.47,
            3.47, 3.48, 3.47, 3.47, 3.47, 3.46, 3.45, 3.44, 3.42, 3.4, 3.38, 3.36,
            3.34, 3.31, 3.29, 3.26, 3.22, 3.19, 3.16, 3.12, 3.08, 3.04, 3, 2.96, 2.91,
            2.87, 2.82, 2.77, 2.73, 2.68, 2.63, 2.58, 2.53, 2.48, 2.42, 2.37, 2.32,
            2.27, 2.22, 2.16, 2.11, 2.06, 2, 1.95, 1.9, 1.85, 1.79, 1.74, 1.69, 1.64,
            1.59, 1.54, 1.49, 1.44, 1.39, 1.34, 1.29, 1.24, 1.19, 1.14, 1.1, 1.05,
            1.01, 0.96, 0.92, 0.87, 0.83, 0.79, 0.75, 0.71, 0.67, 0.63, 0.59, 0.56,
            0.52, 0.49, 0.45, 0.42, 0.39, 0.36, 0.33, 0.3, 0.27, 0.25, 0.22, 0.2,
            0.17, 0.15, 0.13, 0.11, 0.1, 0.08, 0.06, 0.05, 0.04, 0.03, 0.02, 0.01, 0,
            0, 0, 0,
    };
    public static double[] MockF = {
            63.3, 63.3, 63.3, 63.4, 63.7, 64.2, 64.7, 65, 65.2, 65.5, 66, 66.5, 66.9,
            67.4, 67.8, 68.3, 69, 69.7, 70.3, 70.8, 71.4, 72.1, 72.9, 73.6, 74.3, 75,
            75.7, 76.3, 77.1, 78, 78.8, 79.6, 80.4, 81.3, 82.3, 83.1, 83.9, 84.5,
            85.3, 86.2, 87.3, 88.3, 89.1, 89.6, 90, 90.4, 90.6, 90.6, 90.5, 90.3, 90,
            89.5, 89, 88.4, 87.7, 86.9, 86.3, 85.7, 85.1, 84.4, 83.8, 83.3, 83.1, 83,
            83, 83.1, 83.4, 83.7, 84.2, 84.6, 85, 85.6, 86.1, 86.7, 87.1, 87.6, 87.9,
            88.2, 88.3, 88.4, 88.2, 88.1, 87.8, 87.4, 86.9, 86.3, 85.7, 85.1, 84.5,
            83.9, 83.3, 82.8, 82.5, 82.2, 81.9, 81.7, 81.8, 81.6, 81.3, 80.8, 80.6,
            80.7, 80.9, 81.1, 81.1, 81.1, 81.1, 81.2, 81.3, 81.2, 81.1, 81.1, 81,
            80.8, 80.5, 80.2, 79.9, 79.6, 79, 77.4, 75.3, 73.4, 72.6, 72.2, 71.4,
            70.5, 69.5, 68.7, 68, 67.1, 65.9, 64.4, 63.4, 62.7, 62.1, 61.1, 59.9,
            58.8, 58.1, 57.5, 56.8, 56, 55.2, 54.8, 54.8, 55, 55.2, 55.5, 55.9, 56.3,
            56.9, 57.5, 58.2, 58.9, 59.6, 60.2, 60.5, 60.7, 60.9, 61.1, 61.1, 61.1,
            61, 60.7, 60.4, 60.2, 59.9, 59.6, 59.2, 58.8, 58.4, 58, 57.8, 57.7, 57.6,
            57.7, 57.8, 58, 58.2, 58.5, 58.9, 59.3, 59.8, 60.2, 60.7, 61.1, 61.5,
            61.8, 62, 62.2, 62.3, 62.4, 62.4, 62.4, 62.3, 62.2, 62.2, 62.1, 62.5,
            63.3,
    };

    public static double[] MockWatt = {
            -4.09, -4.28, -4.37, -4.3, -4.16, -3.89, -3.87, -2.77, -1.13, -0.11,
            -0.57, -1.42, -0.58, 0.35, 0.4, 2.91, 3.28, 5.28, 7.62, 8.04, 8.91, 8.97,
            9.42, 11.58, 13.56, 14.36, 14.58, 15.15, 15.34, 16.92, 18.83, 18.83,
            18.06, 16.96, 17.01, 17.6, 18.01, 17.53, 16.68, 15.43, 15.24, 14.86,
            14.77, 14.28, 14.3, 14, 13.83, 13.48, 13.27, 13.54, 13.6, 13.48, 13.71,
            13.77, 13.69, 13.62, 13.77, 13.37, 13.74, 13.2, 13.16, 12.76, 12.22,
            12.09, 11.64, 11.23, 10.35, 9.82, 9.54, 9.02, 8.41, 8.04, 7.3, 7.5, 6.67,
            5.97, 6.06, 5.52, 5.34, 5.12, 4.87, 4.33, 4.33, 3.78, 3.42, 3.1, 2.88,
            2.53, 2.28, 2.14, 1.68, 1.57, 1.19, 1.13, 0.86, 0.61, 0.62, 0.54, 0.41,
            0.41, 0.4, 0.4, 0.39, -0.13, -0.12, 0.25, 0.07, 0.13, 0.22, 0.04, 0.39,
            0.39, 0.4, 0.4, 0.41, 0.42, 0.72, 1.98, 2.94, 3.27, 3.4, 5.33, 5.4, 5.85,
            6.16, 6.32, 7.33, 7.5, 8.84, 11.35, 12.19, 11.71, 11.71, 12.79, 13.78,
            14.26, 13.7, 13.41, 13.95, 13.9, 14.09, 13.75, 12.65, 12.64, 12.49, 12.21,
            12.37, 11.86, 11.99, 12, 11.93, 12.49, 12.72, 13.32, 13.64, 13.32, 14.49,
            15.39, 15.64, 16.14, 16.2, 16.99, 17.25, 17.24, 17.2, 17.02, 17.2, 17.21,
            16.58, 15.73, 15.69, 14.73, 14.35, 13.33, 12.6, 11.71, 11.37, 10.4, 9.23,
            8.55, 7.93, 7.15, 6.55, 5.73, 4.65, 4.4, 3.17, 2.31, 1.92, 1.16, 0.63,
            0.42, 0.4, -0.61, -1.32, -1.82, -2.67, -2.61, -3.45, -3.67,
    };

    public static double[] MockI = {
            4.59, 4.71, 4.86, 4.87, 4.71, 4.29, 4.29, 3.16, 1.68, 1.26, 1.18, 1.71,
            1.17, 1.36, 1.44, 5.25, 5.8, 8.73, 12.01, 12.63, 13.78, 13.89, 14.49,
            17.29, 19.72, 20.76, 21.01, 21.7, 21.97, 23.98, 26.44, 26.44, 25.44,
            23.91, 24.06, 24.76, 25.24, 24.72, 23.53, 21.88, 21.67, 21.18, 21.01,
            20.44, 20.44, 20.01, 19.83, 19.35, 19.03, 19.39, 19.44, 19.29, 19.6,
            19.68, 19.5, 19.5, 19.66, 19.17, 19.71, 19.06, 19.05, 18.48, 17.8, 17.62,
            17.14, 16.63, 15.51, 14.91, 14.52, 13.86, 13.09, 12.57, 11.56, 11.83,
            10.63, 9.72, 9.85, 9.15, 8.89, 8.55, 8.22, 7.44, 7.41, 6.63, 6.15, 5.61,
            5.28, 4.72, 4.35, 4.14, 3.43, 3.24, 2.64, 2.47, 2.1, 1.68, 1.71, 1.59,
            1.44, 1.44, 1.44, 1.42, 1.42, 1.32, 1.29, 1.41, 1.38, 1.39, 1.36, 1.32,
            1.42, 1.42, 1.42, 1.42, 1.44, 1.44, 1.92, 3.87, 5.31, 5.82, 6.06, 8.83,
            8.91, 9.54, 10.02, 10.2, 11.62, 11.89, 13.72, 16.95, 18.01, 17.4, 17.31,
            18.66, 19.92, 20.53, 19.87, 19.45, 20.05, 20.07, 20.28, 19.87, 18.51,
            18.51, 18.28, 17.79, 18.06, 17.43, 17.55, 17.59, 17.53, 18.22, 18.54,
            19.3, 19.71, 19.39, 20.86, 21.97, 22.36, 23.01, 23.04, 24.13, 24.42,
            24.37, 24.4, 24.13, 24.4, 24.48, 23.58, 22.57, 22.47, 21.3, 20.82, 19.63,
            18.73, 17.58, 17.2, 15.91, 14.32, 13.44, 12.58, 11.46, 10.57, 9.43, 7.86,
            7.48, 5.67, 4.38, 3.72, 2.58, 1.74, 1.44, 1.44, 1.21, 1.72, 2.19, 2.97,
            2.89, 3.94, 4.17,
    };









}
